"""
Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2**k), не превосходящие числа N.
"""

print("Введите число")
n = int(input())
i =1

while i < n:
    print(i)
    i = i *2